app/views/users/show.html.erb

</tr>
=======
		<% unless @user.microposts.empty? %>
---
SELECT  1 AS one FROM "microposts" WHERE "microposts"."user_id" = ? LIMIT 1  [["user_id", 1]]