app/controllers/users_controller.rb

  def index
	@title = "All users"
	@users = User.paginate(:page => params[:page])
---
SELECT  "users".* FROM "users" LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "users"

  def show
	@user = User.find(params[:id])
<<<<<<< HEAD
=======
	@microposts = @user.microposts.paginate(:page => params[:page])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
SELECT COUNT(*) FROM "microposts" WHERE "microposts"."user_id" = ?  [["user_id", 1]]

  def create
	@user = User.new(params[:user])
	if @user.save
---
INSERT INTO "users" ("name", "email", "salt", "encrypted_password", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

  def update
	@user = User.find(params[:id])
	if @user.update_attributes(params[:user])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 3]]
UPDATE "users" SET "name" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "chunch"], ["updated_at", "2015-09-11 05:11:13.231354"], ["id", 3]]